#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: renovate[bot], Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
sakuracloud_disk.k8s_rook_disk[6]: Refreshing state... [id=113600078892]
sakuracloud_ssh_key_gen.gen_key: Refreshing state... [id=113600078862]
sakuracloud_disk.k8s_rook_disk[0]: Refreshing state... [id=113600078891]
sakuracloud_disk.k8s_rook_disk[3]: Refreshing state... [id=113600078867]
sakuracloud_disk.k8s_rook_disk[1]: Refreshing state... [id=113600078895]
sakuracloud_disk.k8s_rook_disk[7]: Refreshing state... [id=113600078893]
sakuracloud_switch.k8s_internal_switch: Refreshing state... [id=113600078869]
sakuracloud_disk.k8s_rook_disk[4]: Refreshing state... [id=113600078889]
data.sakuracloud_archive.ubuntu_archive: Reading...
sakuracloud_internet.k8s_external_switch: Refreshing state... [id=113600078866]
sakuracloud_disk.k8s_rook_disk[5]: Refreshing state... [id=113600078865]
sakuracloud_disk.k8s_rook_disk[2]: Refreshing state... [id=113600078894]
data.sakuracloud_archive.ubuntu_archive: Read complete after 2s [id=113600510456]
sakuracloud_disk.k8s_router_disk[0]: Refreshing state... [id=113600078864]
sakuracloud_disk.k8s_worker_node_disk[6]: Refreshing state... [id=113600078863]
sakuracloud_disk.k8s_worker_node_disk[2]: Refreshing state... [id=113600078879]
sakuracloud_disk.k8s_worker_node_disk[5]: Refreshing state... [id=113600078875]
sakuracloud_disk.k8s_worker_node_disk[4]: Refreshing state... [id=113600078890]
sakuracloud_disk.k8s_worker_node_disk[1]: Refreshing state... [id=113600078870]
sakuracloud_disk.k8s_worker_node_disk[7]: Refreshing state... [id=113600078896]
sakuracloud_disk.k8s_worker_node_disk[3]: Refreshing state... [id=113600078883]
sakuracloud_disk.k8s_worker_node_disk[0]: Refreshing state... [id=113600078872]
sakuracloud_disk.k8s_control_plane_disk[2]: Refreshing state... [id=113600078873]
sakuracloud_disk.k8s_control_plane_disk[1]: Refreshing state... [id=113600078878]
sakuracloud_disk.k8s_control_plane_disk[0]: Refreshing state... [id=113600078868]
sakuracloud_server.k8s_router[0]: Refreshing state... [id=113600078897]
sakuracloud_server.k8s_worker_node[3]: Refreshing state... [id=113600078918]
sakuracloud_server.k8s_worker_node[1]: Refreshing state... [id=113600078924]
sakuracloud_server.k8s_worker_node[0]: Refreshing state... [id=113600078944]
sakuracloud_server.k8s_worker_node[7]: Refreshing state... [id=113600078923]
sakuracloud_server.k8s_worker_node[5]: Refreshing state... [id=113600078922]
sakuracloud_server.k8s_worker_node[2]: Refreshing state... [id=113600078921]
sakuracloud_server.k8s_worker_node[6]: Refreshing state... [id=113600078920]
sakuracloud_server.k8s_worker_node[4]: Refreshing state... [id=113600078939]
sakuracloud_server.k8s_control_plane[0]: Refreshing state... [id=113600078901]
sakuracloud_server.k8s_control_plane[1]: Refreshing state... [id=113600078905]
sakuracloud_server.k8s_control_plane[2]: Refreshing state... [id=113600078900]
sakuracloud_subnet.bgp_subnet: Refreshing state... [id=15770]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # sakuracloud_server.k8s_router[0] has been deleted
  - resource "sakuracloud_server" "k8s_router" {
        id                = "113600078897"
      - ip_address        = "163.43.210.4" -> null
        name              = "k8s-dev-router-1"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # sakuracloud_disk.k8s_control_plane_disk[0] will be created
  + resource "sakuracloud_disk" "k8s_control_plane_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "k8s-dev-control-plane-1"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + source_archive_id    = "113600510456"
      + tags                 = [
          + "dev",
          + "k8s",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_control_plane_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113600078878" -> (known after apply)
        name                 = "k8s-dev-control-plane-2"
      + server_id            = (known after apply)
      ~ source_archive_id    = "113402076879" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113600078873" -> (known after apply)
        name                 = "k8s-dev-control-plane-3"
      + server_id            = (known after apply)
      ~ source_archive_id    = "113402076879" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_rook_disk[6] will be created
  + resource "sakuracloud_disk" "k8s_rook_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "k8s-dev-rook-7"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + tags                 = [
          + "dev",
          + "k8s",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_router_disk[0] will be created
  + resource "sakuracloud_disk" "k8s_router_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "k8s-dev-router-1"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + source_archive_id    = "113600510456"
      + tags                 = [
          + "dev",
          + "k8s",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_worker_node_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113600078872" -> (known after apply)
        name                 = "k8s-dev-worker-node-1"
      + server_id            = (known after apply)
      ~ source_archive_id    = "113402076879" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[1] will be created
  + resource "sakuracloud_disk" "k8s_worker_node_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "k8s-dev-worker-node-2"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + source_archive_id    = "113600510456"
      + tags                 = [
          + "dev",
          + "k8s",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_worker_node_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113600078879" -> (known after apply)
        name                 = "k8s-dev-worker-node-3"
      + server_id            = (known after apply)
      ~ source_archive_id    = "113402076879" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[3] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113600078883" -> (known after apply)
        name                 = "k8s-dev-worker-node-4"
      + server_id            = (known after apply)
      ~ source_archive_id    = "113402076879" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[4] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113600078890" -> (known after apply)
        name                 = "k8s-dev-worker-node-5"
      + server_id            = (known after apply)
      ~ source_archive_id    = "113402076879" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[5] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113600078875" -> (known after apply)
        name                 = "k8s-dev-worker-node-6"
      + server_id            = (known after apply)
      ~ source_archive_id    = "113402076879" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[6] will be created
  + resource "sakuracloud_disk" "k8s_worker_node_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "k8s-dev-worker-node-7"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + source_archive_id    = "113600510456"
      + tags                 = [
          + "dev",
          + "k8s",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_worker_node_disk[7] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113600078896" -> (known after apply)
        name                 = "k8s-dev-worker-node-8"
      + server_id            = (known after apply)
      ~ source_archive_id    = "113402076879" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_internet.k8s_external_switch will be updated in-place
  ~ resource "sakuracloud_internet" "k8s_external_switch" {
        id                   = "113600078866"
      ~ name                 = "k8s-external-switch" -> "k8s-dev-external-switch"
        tags                 = []
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_server.k8s_control_plane[0] will be created
  + resource "sakuracloud_server" "k8s_control_plane" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-control-plane-1"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.210.1"
          + hostname        = "k8s-dev-control-plane-1"
          + ip_address      = "163.43.210.5"
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113600078862",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113600078871"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113600078869"
          + user_ip_address = "192.168.100.10"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_control_plane[1] will be created
  + resource "sakuracloud_server" "k8s_control_plane" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-control-plane-2"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.210.1"
          + hostname        = "k8s-dev-control-plane-2"
          + ip_address      = "163.43.210.6"
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113600078862",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113600078871"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113600078869"
          + user_ip_address = "192.168.100.11"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_control_plane[2] will be created
  + resource "sakuracloud_server" "k8s_control_plane" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-control-plane-3"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.210.1"
          + hostname        = "k8s-dev-control-plane-3"
          + ip_address      = "163.43.210.7"
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113600078862",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113600078871"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113600078869"
          + user_ip_address = "192.168.100.12"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_router[0] will be created
  + resource "sakuracloud_server" "k8s_router" {
      + commitment        = "standard"
      + core              = 1
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 1
      + name              = "k8s-dev-router-1"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.210.1"
          + hostname        = "k8s-dev-router-1"
          + ip_address      = "163.43.210.4"
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113600078862",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113600078871"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113600078869"
          + user_ip_address = "192.168.100.0"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[0] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-1"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.210.1"
          + hostname        = "k8s-dev-worker-node-1"
          + ip_address      = "163.43.210.8"
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113600078862",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113600078871"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113600078869"
          + user_ip_address = "192.168.100.20"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[1] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-2"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.210.1"
          + hostname        = "k8s-dev-worker-node-2"
          + ip_address      = "163.43.210.9"
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113600078862",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113600078871"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113600078869"
          + user_ip_address = "192.168.100.21"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[2] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-3"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.210.1"
          + hostname        = "k8s-dev-worker-node-3"
          + ip_address      = "163.43.210.10"
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113600078862",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113600078871"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113600078869"
          + user_ip_address = "192.168.100.22"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[3] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-4"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.210.1"
          + hostname        = "k8s-dev-worker-node-4"
          + ip_address      = "163.43.210.11"
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113600078862",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113600078871"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113600078869"
          + user_ip_address = "192.168.100.23"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[4] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-5"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.210.1"
          + hostname        = "k8s-dev-worker-node-5"
          + ip_address      = "163.43.210.12"
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113600078862",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113600078871"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113600078869"
          + user_ip_address = "192.168.100.24"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[5] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-6"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.210.1"
          + hostname        = "k8s-dev-worker-node-6"
          + ip_address      = "163.43.210.13"
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113600078862",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113600078871"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113600078869"
          + user_ip_address = "192.168.100.25"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[6] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-7"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.210.1"
          + hostname        = "k8s-dev-worker-node-7"
          + ip_address      = "163.43.210.14"
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113600078862",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113600078871"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113600078869"
          + user_ip_address = "192.168.100.26"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[7] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-8"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.210.1"
          + hostname        = "k8s-dev-worker-node-8"
          + ip_address      = "163.43.210.15"
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113600078862",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113600078871"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113600078869"
          + user_ip_address = "192.168.100.27"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_subnet.bgp_subnet will be updated in-place
  ~ resource "sakuracloud_subnet" "bgp_subnet" {
        id              = "15770"
      ~ next_hop        = "163.43.210.4" -> (known after apply)
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_switch.k8s_internal_switch will be updated in-place
  ~ resource "sakuracloud_switch" "k8s_internal_switch" {
        id          = "113600078869"
      ~ name        = "k8s-internal-switch" -> "k8s-dev-internal-switch"
        tags        = []
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 25 to add, 3 to change, 8 to destroy.

Changes to Outputs:
  ~ k8s_control_plane_ip_address = [
      ~ "163.43.210.5" -> (known after apply),
      ~ "163.43.210.6" -> (known after apply),
      ~ "163.43.210.7" -> (known after apply),
    ]
  ~ k8s_router_ip_address        = [
      ~ "163.43.210.4" -> (known after apply),
    ]
  ~ k8s_worker_node_ip_address   = [
      ~ "163.43.210.8" -> (known after apply),
      ~ "163.43.210.9" -> (known after apply),
      ~ "163.43.210.10" -> (known after apply),
      ~ "163.43.210.11" -> (known after apply),
      ~ "163.43.210.12" -> (known after apply),
      ~ "163.43.210.13" -> (known after apply),
      ~ "163.43.210.14" -> (known after apply),
      ~ "163.43.210.15" -> (known after apply),
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>